let items = exports;

items.itemList = [
    /*Имя, хеш объекта, может экипировать, вес, объем (ширина * на длинну * на высоту), цены */
    ['Стяжки', '', 0, -1145063624, 50, 100, 25], //0
    ['Мешок', '', 0, -1194335261, 100, 2400, 50], //1

    ['Кокаин', '', 0, 1808635348, 1, 1, 111111], //2
    ['Лечебная марихуана', '', 0, 671777952, 1, 5, 111111], //3

    ['Отмычка', '', 0, -1803909274, 50, 6, 100], //4
    ['Масло', '', 0, -1532806025, 3000, 10000, 150], //5
    ['Набор инструментов', '', 0, 648185618, 4500, 12800, 250], //6

    ['Электронные часы "IFruit"', '', 0, 1169295068, 190, 110, 620], //7

    ['Канистра (Авиатопливо)', 'weapon_petrolcan', 0, 1069395324, 10000, 11300, 30], //8
    ['Канистра (Бензин)', 'weapon_petrolcan', 0, 1069395324, 10000, 11300, 15], //9
    ['Канистра (Дизель)', 'weapon_petrolcan', 0, 1069395324, 10000, 11300, 11], //10

    ["Phat Chips со вкусом сыра", "", 0, 1108364521, 225, 600, 20], //11
    ["Баночка томатного супа No. 1", "", 0, 910205311, 300, 400, 40], //12
    ["Шоколадка Zebra", "", 0, -1803909274, 50, 100, 10], //13
    ["Жвачка Release с мятой", "", 0, -1803909274, 20, 70, 5], //14
    ["Лапша Noodles со вкусом курицы", "", 0, 910205311, 150, 450, 20], //15
    ["Лапша Noodles со вкусом морепродуктов", "", 0, 910205311, 150, 450, 20], //16
    ["Пончик Rusty Brown\'s ", "", 0, -1803909274, 60, 100, 15], //17
    ["Конфеты Sweet Nothings", "", 0, -1803909274, 25, 70, 18], //18
    ["Стаканчик грушевого йогурта Biotic Life", "", 0, 936464539, 200, 300, 8], //19
    ["Коробка хлопьев Rails", "", 0, 910205311, 500, 2000, 30], //20
    ["Пастила P\'s & Q\'s", "", 0, -1803909274, 50, 100, 5], //21
    ["Яблоко", "", 0, 910205311, 200, 350, 10], //22
    ["Апельсин", "", 0, 910205311, 150, 300, 10], //23
    ["Груша", "", 0, 910205311, 180, 320, 10], //24
    ["Банан", "", 0, 1108364521, 250, 500, 10], //25
    ["Пачка сигарет RedWood", "", 0, -593364948, 40, 200, 20], //26

    ['Телефон IFruit', '', 0, -1038739674, 120, 156, 2600], //27
    ['Телефон Facade', '', 0, 1907022252, 120, 156, 1200], //28
    ['Телефон Badger', '', 0, -2017357667, 120, 156, 2200], //29
    ['Телефон IFruit', '', 0, -1038739674, 120, 156, 2600], //30

    ['Адреналин', '', 0, -1282296755, 50, 6, 350], //31
    ['Сухпаек', '', 0, 9168982, 2000, 5800, 270], //32
    ['Уголь', '', 0, -756465278, 40, 6, 100], //33
    ['Сироп', '', 0, -756465278, 75, 3, 120], //34
    ['Cосудосуживающий таблетка', '', 0, -756465278, 30, 6, 200], //35
    ['Таблетка от кашля', '', 0, -756465278, 40, 6, 150], //36
    ['Витаминки', '', 0, -756465278, 55, 6, 80], //37
    ['Жаропонижающий', '', 0, -756465278, 35, 6, 100], //38
    ['Антибиотик', '', 0, -756465278, 35, 6, 250], //39

    ['Наручники', '', 0, -1281059971, 340, 120, 500], //40

    ['Ключ от тс', '', 0, 977923025, 6, 3, 111111], //41
    ['Ключ от офиса', '', 0, -331172978, 6, 3, 111111], //42
    ['Ключ от дома', '', 0, -331172978, 6, 3, 111111], //43
    ['Ключ от квартиры', '', 0, -331172978, 6, 3, 111111], //44

    ['Слот', '', 0, 9168982, 650, 2800, 111111], //45
    ['Слот', '', 0, 9168982, 650, 3800, 111111], //46

    ['Рация', '', 0, -1964402432, 250, 170, 1250], //47
    ['Кошелёк', '', 0, -34897201, 120, 150, 400], //48
    ['Письма', '', 0, 406712611, 80, 410, 111111], //49
    ['Банковская карта', '', 0, -1282513796, 15, 8, 111111], //50
    ['Паспорт', '', 0, -1750183478, 40, 16, 111111], //51
    ['Лицензия', '', 0, -925658112, 30, 116, 111111], //52
    ['Удостоверение', '', 0, -1595369626, 15, 8, 111111], //53

    ['Кавалерийский кинжал', 'weapon_dagger', 0, 1725061196, 400, 450, 1250], //54
    ['Бейсбольная бита', 'weapon_bat', 0, 1742452667, 1500, 2000, 350], //55
    ['Боевой топор', 'weapon_battleaxe', 0, 2133533553, 2200, 2400, 2000], //56
    ['Розочка', 'weapon_bottle', 0, -789123952, 110, 540, 10], //57
    ['Лом', 'weapon_crowbar', 0, 1862268168, 3200, 1050, 100], //58
    ['Фонарик', 'weapon_flashlight', 0, 211760048, 340, 400, 70], //59
    ['Клюшка для гольфа', 'weapon_golfclub', 0, -580196246, 2900, 1150, 1500], //60
    ['Молоток', 'weapon_hammer', 0, 64104227, 860, 430, 100], //61
    ['Топорик', 'weapon_hatchet', 0, 1653948529, 930, 860, 1500], //62
    ['Нож', 'weapon_knife', 0, -1982443329, 560, 520, 180], //63
    ['Кастет', 'weapon_knuckle', 0, -1803909274, 450, 80, 750], //64
    ['Мачете', 'weapon_machete', 0, -2055486531, 1120, 525, 2000], //65
    ['Полицейская дубинка', 'weapon_nightstick', 0, -1634978236, 880, 970, 500], //66
    ['Разводной ключ', 'weapon_wrench', 0, 10555072, 1760, 1490, 99], //67
    ['Бильярдный кий', 'weapon_poolcue', 0, -1982443329, 470, 160, 900], //68
    ['Выкидной нож', 'weapon_switchblade', 0, 1653948529, 130, 60, 360], //69

    ['Сolt SCAMP', 'weapon_appistol', 0, 905830540, 1500, 950, 8500], //70
    ['P99', 'weapon_combatpistol', 0, 403140669, 800, 660, 5500], //71
    ['Сигнальный пистолет', 'weapon_flaregun', 0, 1349014803, 440, 270, 3500], //72
    ['Remington 1911', 'weapon_heavypistol', 0, 1927398017, 1120, 850, 12500], //73
    ['Raging Bull', 'weapon_revolver', 0, 1430410579, 1440, 1080, 8500], //74
    ['Raging Bull Mk II', 'weapon_revolver_mk2', 0, 1430410579, 1990, 1080, 11000], //75
    ['Contender G2', 'weapon_marksmanpistol', 0, 1430410579, 1360, 1800, 9000], //76
    ['Taurus PT92', 'weapon_pistol', 0, 1467525553, 950, 1230, 6000], //77
    ['Beretta 90Two', 'weapon_pistol_mk2', 0, 1430410579, 920, 1050, 8500], //78
    ['Desert Eagle', 'weapon_pistol50', 0, -178484015, 1700, 1720, 9000], //79
    ['HK P7M10', 'weapon_snspistol', 0, 339962010, 785, 660, 4000], //80
    ['Colt Junior', 'weapon_snspistol_mk2', 0, 1430410579, 365, 310, 5500], //81
    ['Шокер', 'weapon_stungun', 0, 1609356763, 760, 680, 2500], //82
    ['FN Model 1922', 'weapon_vintagepistol', 0, -1124046276, 700, 720, 4000], //83
    ['Colt New Service', 'weapon_doubleaction', 0, 1430410579, 1450, 1170, 6500], //84

    ['UTS-15', 'weapon_assaultshotgun', 0, 1255410010, 2800, 11500, 15000], //85
    ['KSG 12', 'weapon_bullpupshotgun', 0, -1598212834, 3100, 9500, 13000], //86
    ['Обрез', 'weapon_dbshotgun', 0, -1920611843, 1410, 1800, 7500], //87
    ['Сайга-12К', 'weapon_heavyshotgun', 0, -1209868881, 3500, 10900, 10000], //88
    ['Land Pattern Musket', 'weapon_musket', 0, 1652015642, 4300, 14400, 6500], //89
    ['Benelli M3', 'weapon_pumpshotgun', 0, 689760839, 4500, 16100, 8500], //90
    ['Benelli M4', 'weapon_pumpshotgun_mk2', 0, 798951501, 3500, 17600, 9500], //91
    ['Mossberg 500', 'weapon_sawnoffshotgun', 0, -675841386, 2100, 3800, 7000], //92
    ['Protecta', 'weapon_autoshotgun', 0, -1920611843, 2900, 6800, 11000], //93

    ['P-90', 'weapon_assaultsmg', 0, -473574177, 2800, 8800, 8500], //94
    ['Mk 48', 'weapon_combatmg', 0, -739394447, 8000, 16000, 20000], //95
    ['HK MG4', 'weapon_combatmg_mk2', 0, 798951501, 8150, 17600, 25000], //96
    ['SIG MPX-SD', 'weapon_combatpdw', 0, -1393014804, 2700, 5000, 8500], //97
    ['Thompson M1918A1', 'weapon_gusenberg', 0, 574348740, 8400, 18400, 13500], //98
    ['Intratec TEC-9', 'weapon_machinepistol', 0, 1430410579, 1500, 1660, 6500], //99
    ['ПКП «Печенег»', 'weapon_mg', 1, -2056364402, 8200, 17250, 18000], //100
    ['Mini Uzi', 'weapon_microsmg', 0, -1056713654, 2650, 2500, 7500], //101
    ['Scorpion vz.61', 'weapon_minismg', 0, 1430410579, 2000, 1900, 7000], //102
    ['MP5A3', 'weapon_smg', 0, -500057996, 3200, 7800, 9000], //103
    ['MP5K', 'weapon_smg_mk2', 0, -1920611843, 3350, 8100, 11500], //104

    ['TAR-21', 'weapon_advancedrifle', 0, -1707584974, 3270, 12400, 10000], //105
    ['AK-102', 'weapon_assaultrifle', 0, 273925117, 3200, 14700, 13500], //106
    ['AK-103', 'weapon_assaultrifle_mk2', 0, 798951501, 3600, 16200, 16000], //107
    ['QBZ-97', 'weapon_bullpuprifle', 0, -1288559573, 3250, 13500, 11000], //108
    ['QBZ-95', 'weapon_bullpuprifle_mk2', 0, 798951501, 3350, 13900, 14000], //109
    ['HK-416', 'weapon_carbinerifle', 0, 1026431720, 3490, 14200, 12500], //110
    ['HK-416A5', 'weapon_carbinerifle_mk2', 0, 798951501, 3560, 14900, 15000], //111
    ['AKS-74u', 'weapon_compactrifle', 0, -1920611843, 2400, 5700, 13000], //112
    ['G36C', 'weapon_specialcarbine', 0, -1745643757, 2980, 12000, 12500], //113
    ['G36KV', 'weapon_specialcarbine_mk2', 0, 798951501, 3370, 13900, 15000], //114

    ['M107', 'weapon_heavysniper', 0, -746966080, 13500, 21000, 27000], //115
    ['XM109', 'weapon_heavysniper_mk2', 0, 798951501, 14000, 24500, 35000], //116
    ['M14 EBR', 'weapon_marksmanrifle', 0, -1711248638, 5100, 17800, 21000], //117
    ['SOCOM 16', 'weapon_marksmanrifle_mk2', 0, 798951501, 5900, 18200, 24000], //118
    ['L115A3', 'weapon_sniperrifle', 0, 346403307, 6600, 14400, 23000], //119

    ['M79', 'weapon_compactlauncher', 0, -1920611843, 50, 2050, 35000], //120
    ['Пиротехническая установка', 'weapon_firework', 0, 491091384, 8500, 29000, 40000], //121
    ['M32 MGL', 'weapon_grenadelauncher', 0, -606683246, 5300, 19500, 50000], //122
    ['FIM 92 Stinger', 'weapon_hominglauncher', 0, 1901887007, 13500, 29000, 65000], //123
    ['M134', 'weapon_minigun', 0, 422658457, 30000, 50000, 120000], //124
    ['Рельсовое оружие', 'weapon_railgun', 0, -1876506235, 14900, 22500, 170000], //125
    ['РПГ-7', 'weapon_rpg', 0, -218858073, 6000, 46000, 45000], //126

    ['Мяч', 'weapon_ball', 0, -383950123, 250, 310, 500], //127
    ['Дымовая гранта', 'weapon_smokegrenade', 0, -1936212109, 690, 485, 1500], //128
    ['Сигнальный огонь', 'weapon_flare', 0, -1564193152, 250, 180, 1250], //129
    ['Граната', 'weapon_grenade', 0, 290600267, 890, 410, 2000], //130
    ['Коктейль Молотова', 'weapon_molotov', 0, -880609331, 660, 720, 1800], //131
    ['Неконтактная мина', 'weapon_proxmine', 0, 1876445962, 850, 1200, 2500], //132
    ['Самодельная бомба', 'weapon_pipebomb', 0, 848107085, 430, 180, 3500], //133
    ['Снежок', 'weapon_snowball', 0, 1297482736, 250, 310, 1], //134
    ['Бомба-липучка', 'weapon_stickybomb', 0, -1110203649, 750, 1200, 4500], //135
    ['Слезоточивый газ', 'weapon_bzgas', 0, 1591549914, 690, 485, 4000], //136

    ['Парашют', 'gadget_parachute', 0, -1679378668, 3200, 7500, 1250], //137

    ['Купюра 1$', '', 0, 1814532926, 1, 1, 1], //138
    ['Купюра 100$', '', 0, 1597489407, 1, 1, 100], //139
    ['Маленькая пачка 100$', '', 0, -1170050911, 100, 100, 111111], //140
    ['Большая пачка 100$', '', 0, -1448063107, 300, 300, 111111], //141

    ['Упаковка кокаина 1кг', '', 0, 525896218, 1000, 1000, 111111], //142
    ['Упаковка марихуаны 200г', '', 0, -395076527, 200, 1000, 111111], //143
    ['Упаковка кокаина 5кг', '', 0, -1688127, 5000, 5000, 111111], //144
    ['Упаковка марихуаны 800г', '', 0, -680115871, 800, 4000, 111111], //145

    ['Слот', '', 0, 1843823183, 8900, 1568, 111111], //146
    ['Слот', '', 0, 1843823183, 1600, 1568, 111111], //147
    ['Слот', '', 0, 1843823183, 1600, 1568, 111111], //148
    ['Слот', '', 0, 1843823183, 2200, 1568, 111111], //149
    ['Слот', '', 0, 1843823183, 3800, 1568, 111111], //150
    ['Слот', '', 0, 1843823183, 3800, 1568, 111111], //151
    ['Слот', '', 0, 1843823183, 1500, 1568, 111111], //152
    ['Слот', '', 0, 190687980, 1140, 432, 111111], //153

    ['Кокаин (10гр)', '', 0, 1808635348, 10, 10, 111111], //154
    ['Лечебная марихуана (10гр)', '', 0, 671777952, 10, 50, 111111], //155
    ['Кокаин (50гр)', '', 0, 1808635348, 50, 50, 111111], //156
    ['Лечебная марихуана (50гр)', '', 0, 671777952, 50, 250, 111111], //157

    ['Амфетамин', '', 0, 1808635348, 1, 1, 111111], //158
    ['DMT', '', 0, 1808635348, 1, 1, 111111], //159
    ['Мефедрон', '', 0, 1808635348, 1, 1, 111111], //160
    ['Кетамин', '', 0, 671777952, 1, 5, 111111], //161
    ['LSD', '', 0, 671777952, 1, 5, 111111], //162

    ['Упаковка амфетамина 1кг', '', 0, 525896218, 1000, 1000, 111111], //163
    ['Упаковка амфетамина 5кг', '', 0, -1688127, 5000, 5000, 111111], //164

    ['Упаковка DMT 1кг', '', 0, 525896218, 1000, 1000, 111111], //165
    ['Упаковка DMT 5кг', '', 0, -1688127, 5000, 5000, 111111], //166

    ['Упаковка мефедрона 1кг', '', 0, 525896218, 1000, 1000, 111111], //167
    ['Упаковка мефедрона 5кг', '', 0, -1688127, 5000, 5000, 111111], //168

    ['Упаковка кетамина 1кг', '', 0, 1430410579, 1000, 3000, 111111], //169
    ['Упаковка LSD 1кг', '', 0, 1430410579, 1000, 3000, 111111], //170

    ['Амфетамин (10гр)', '', 0, 1808635348, 10, 10, 111111], //171
    ['DMT (10гр)', '', 0, 1808635348, 10, 10, 111111], //172
    ['Мефедрон (10гр)', '', 0, 1808635348, 10, 10, 111111], //173
    ['Кетамин (10гр)', '', 0, 671777952, 10, 50, 111111], //174
    ['LSD (10гр)', '', 0, 671777952, 10, 50, 111111], //175

    ['Амфетамин (50гр)', '', 0, 1808635348, 50, 50, 111111], //176
    ['DMT (50гр)', '', 0, 1808635348, 50, 50, 111111], //177
    ['Мефедрон (50гр)', '', 0, 1808635348, 50, 50, 111111], //178
    ['Кетамин (50гр)', '', 0, 671777952, 50, 250, 111111], //179
    ['LSD (50гр)', '', 0, 671777952, 50, 250, 111111], //180

    ['Деревянный ящик Gray Tea', '', 0, -1147461795, 15000, 500000, 111111], //181
    ['Коробка Листов A4', '', 0, 1465830963, 2500, 40000, 111111], //182
    ['Коробка Redwood', '', 0, 1465830963, 2500, 35000, 111111], //183
    ['Коробка Clucking Bell', '', 0, 250374685, 15000, 70000, 111111], //184
    ['Коробка Jo Jo diet Cola', '', 0, -1244905398, 8000, 25000, 111111], //185
    ['Коробка Craft', '', 0, -517243780, 40000, 70000, 111111], //186
    ['Коробка Fish and Roll', '', 0, -1563678327, 60000, 450000, 111111], //187
    ['Деревянный ящик GoPostal', '', 0, -1649986476, 19000, 300000, 111111], //188
    ['Огромная деревянный ящик', '', 0, 1955876122, 420000, 5000000, 111111], //189
    ['Важная деревянный ящик', '', 0, 307713837, 120000, 1250000, 111111], //190
    ['Коробка из китая', '', 0, -1513883840, 35000, 450000, 111111], //191
    ['Важная коробка', '', 0, -1438964996, 12000, 250000, 111111], //192
    ['Маленькая коробка', '', 0, -721895765, 4000, 55000, 111111], //193

    ['Полосатая бочка', '', 0, 546252211, 30000, 5000, 111111], //194
    ['Ограждение со стрелкой', '', 0, 1867879106, 8000, 5000, 111111], //195
    ['Длинное ограждение', '', 0, -205311355, 10000, 5000, 111111], //196
    ['Деревянное ограждение', '', 0, 1072616162, 5000, 5000, 111111], //197
    ['Деревянное ограждение с огнём', '', 0, 1329951119, 5000, 5000, 111111], //198
    ['Полицейское огорождение', '', 0, -143315610, 9000, 5000, 111111], //199
    ['Длинный полосатый конус', '', 0, 939377219, 1000, 3000, 111111], //200
    ['Полосатый конус', '', 0, 1245865676, 1000, 3000, 111111], //201
    ['Красный конус', '', 0, 862664990, 1000, 3000, 111111], //202
    ['Длинный конус с огнями', '', 0, -1587301201, 1000, 3000, 111111], //203

    ['Капсула с таблетками', '', 0, -2127785247, 50, 25, 111111], //204
    ['Огромная стекляная бутыль', '', 0, -1382355819, 3000, 6750, 111111], //205
    ['Капсула с таблетками', '', 0, -756465278, 50, 30, 111111], //206
    ['Бутыль', '', 0, 393961710, 250, 250, 111111], //207
    ['Сироп', '', 0, 1648892290, 120, 170, 111111], //208
    ['Большая стекляная банка', '', 0, 566302905, 1500, 4200, 111111], //209
    ['Стекляная банка', '', 0, -2034834785, 500, 1400, 111111], //210
    ['Контейнер с пробирками', '', 0, -330775550, 4500, 6000, 111111], //211
    ['Контейнер для пробирок', '', 0, -192665395, 2000, 6000, 111111], //212
    ['Пробирка', '', 0, -2022085894, 500, 60, 111111], //213
    ['Шприц', '', 0, -61966571, 50, 6, 111111], //214
    ['Аптечка', '', 0, 678958360, 500, 880, 111111], //215
    ['Бинт', '', 0, 546339338, 70, 280, 111111], //216
    ['Большой бинт', '', 0, 580223600, 120, 410, 111111], //217
    ['Таблетки', '', 0, -1129328507, 20, 10, 111111], //218
    ['Бутыль с перекисью водорода', '', 0, 1254553771, 3000, 8000, 111111], //219
    ['Упаковка таблеток', '', 0, 1787587532, 50, 130, 111111], //220
    ['Антипохмелин', '', 0, 1547095841, 12, 130, 111111], //221
    ['Упаковка таблеток', '', 0, 1174512311, 50, 130, 111111], //222

    ['Сырое мясо тунца', '', 0, 936464539, 1000, 3000, 111111], //223
    ['Сырое мясо окуня', '', 0, 936464539, 300, 800, 111111], //224
    ['Сырое мясо краба', '', 0, 936464539, 600, 4000, 111111], //225
    ['Сырое мясо лосося', '', 0, 936464539, 290, 1000, 111111], //226
    ['Сырое мясо креветок', '', 0, 936464539, 290, 600, 111111], //227
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //228
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //229
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //230
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //231

    ['Мясо тунца', '', 0, 936464539, 1000, 3000, 111111], //232
    ['Мясо окуня', '', 0, 936464539, 300, 800, 111111], //233
    ['Мясо краба', '', 0, 936464539, 600, 4000, 111111], //234
    ['Мясо лосося', '', 0, 936464539, 290, 1000, 111111], //235
    ['Мясо креветок', '', 0, 936464539, 290, 600, 111111], //236
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //237
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //238
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //239
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //240

    ["Баночка E-Cola", "", 0, 144995201, 340, 400, 15], //241
    ["Бутылка воды Rainé", "", 0, 724797387, 500, 650, 10], //242
    ["Бутылка пива A.M.", "", 0, -1301244203, 700, 600, 31], //243
    ["Бутылка пива Stronzo", "", 0, -1301244203, 700, 600, 32], //244
    ["Бутылка пива Pißwasser", "", 0, -1301244203, 700, 600, 28], //245
    ["Бутылка пива Patriot", "", 0, -1301244203, 700, 600, 29], //246
    ["Бутылка водки Nogo", "", 0, 1925761914, 1200, 1100, 150], //247
    ["Бутылка вина Rockford Hill Reserve", "", 0, -1756838334, 1400, 1100, 250], //248
    ["Бутылка рома Ragga", "", 0, -154609122, 700, 700, 220], //249
    ["Бутылка коньяка Bourgeoix", "", 0, 1404018125, 700, 700, 350], //250

    ['Удочка', '', 0, 1338703913, 3560, 14900, 800], //251
    ['Бронежилет', '', 0, 701173564, 3560, 14900, 6000], //252
    ['Игральные кости', '', 0, -1803909274, 50, 6, 10], //253

    ['Маленький розовый член', '', 0, -422877666, 250, 195, 850], //254
    ['Красный вибратор ', '', 0, -463441113, 450, 440, 1000], //255
    ['Фиолетовый член', '', 0, -731262150, 330, 290, 1000], //256
    ['Кожаный член', '', 0, -1980613044, 320, 285, 1500], //257
    ['Позолоченный член', '', 0, 2009373169, 390, 180, 3000], //258
    ['Металлический член', '', 0, -1921596075, 390, 180, 2000], //259
    ['Большой резиновый член', '', 0, 1333481871, 950, 2100, 2000], //260
    ['Анальная смазка', '', 0, 1553232197, 250, 540, 800], //261

    ['C4 (Мощная)', 'StickyBomb', 0, -1110203649, 750, 1200, 111111], //262

    ['Рюкзак', '', 0, -1158162337, 2000, 20000, 111111], //263
    ['Сумка', '', 0, -1158162337, 2000, 50000, 111111], //264
    ['Одежда', '', 0, -1158162337, 2000, 4500, 111111], //265
    ['Штаны', '', 0, -1158162337, 2000, 4500, 111111], //266
    ['Обувь', '', 0, 101151147, 1500, 3000, 111111], //267
    ['Аксессуар', '', 0, 1267833770, 400, 1200, 111111], //268
    ['Головной убор', '', 0, 1267833770, 500, 1500, 111111], //269
    ['Очки', '', 0, 1298569174, 200, 350, 111111], //270
    ['Серьги', '', 1, 1267833770, 150, 90, 111111], //271
    ['Часы', '', 0, 1267833770, 250, 300, 111111], //272
    ['Браслет', '', 0, 1267833770, 250, 300, 111111], //273
    ['Маска', '', 0, 1267833770, 400, 1200, 111111], //274

    ['Коробка отмычек', '', 0, 1267833770, 500, 60, 111111], //275
    ['Коробка спец. отмычек', '', 0, 1267833770, 1500, 180, 111111], //276

    ['Лотерейный билет', '', 0, 406712611, 80, 410, 1000], //277
    ['Спец. Аптечка', '', 0, 678958360, 500, 880, 1750], //278

    ['Коробка патронов', '', 0, 1843823183, 3800, 1568, 111111], //279
    ['Коробка патронов 9mm', '', 0, 190687980, 1140, 432, 850], //280
    ['Коробка патронов 12 калибра', '', 0, 1560006187, 2420, 1024, 1500], //281
    ['Коробка патронов 7.62mm', '', 0, 669213687, 2580, 686, 1000], //282
    ['Коробка патронов 5.45mm', '', 0, 1843823183, 3620, 1568, 950], //283
    ['Коробка патронов 5.56mm', '', 0, 1843823183, 3620, 1568, 950], //284
    ['Коробка патронов 12.7mm', '', 0, 1843823183, 8900, 1568, 1250], //285
    ['Коробка патронов .45 ACP', '', 0, 1843823183, 8900, 1568, 950], //286
    ['Коробка патронов .44 Magnum', '', 0, 1843823183, 8900, 1568, 950], //287
    ['Коробка патронов сингального пистолета', '', 0, 1843823183, 1600, 1568, 1000], //288
    ['Коробка патронов феерверка', '', 0, 1843823183, 1600, 1568, 1750], //289
    ['Коробка подствольных гранат', '', 0, 1843823183, 3800, 1568, 5000], //290
    ['Коробка патронов RPG', '', 0, 1843823183, 2200, 1568, 2500], //291
    ['Коробка патронов Stinger', '', 0, 1843823183, 1500, 1568, 3000], //292

    ['Фонарик', 'weapon_pistol', 899381934, 999, 999, 999, 350], //293
    ['Глушитель', 'weapon_pistol', 1709866683, 999, 999, 999, 1500], //294

    ['Фонарик', 'weapon_combatpistol', 899381934, 999, 999, 999, 350], //295
    ['Глушитель', 'weapon_combatpistol', -1023114086, 999, 999, 999, 1500], //296

    ['Фонарик', 'weapon_appistol', 899381934, 999, 999, 999, 350], //297
    ['Глушитель', 'weapon_appistol', -1023114086, 999, 999, 999, 1500], //298

    ['Фонарик', 'weapon_pistol50', 899381934, 999, 999, 999, 350], //299
    ['Глушитель', 'weapon_pistol50', -1489156508, 999, 999, 999, 1500], //300

    ['Фонарик', 'weapon_heavypistol', 899381934, 999, 999, 999, 350], //301
    ['Глушитель', 'weapon_heavypistol', -1023114086, 999, 999, 999, 1500], //302

    ['Голографический прицел', 'weapon_revolver_mk2', 1108334355, 999, 999, 999, 2500], //303
    ['Прицел малой кратности', 'weapon_revolver_mk2', 77277509, 999, 999, 999, 3000], //304
    ['Фонарик', 'weapon_revolver_mk2', 899381934, 999, 999, 999, 350], //305
    ['Компенсатор', 'weapon_revolver_mk2', 654802123, 999, 999, 999, 1850], //306

    ['Фонарик', 'weapon_snspistol_mk2', 1246324211, 999, 999, 999, 350], //307
    ['Оптический прицел', 'weapon_snspistol_mk2', 2112431491, 999, 999, 999, 3500], //308
    ['Компенсатор', 'weapon_snspistol_mk2', -1434287169, 999, 999, 999, 1850], //309
    ['Глушитель', 'weapon_snspistol_mk2', 1709866683, 999, 999, 999, 1500], //310

    ['Фонарик', 'weapon_pistol_mk2', 1140676955, 999, 999, 999, 350], //311
    ['Оптический прицел', 'weapon_pistol_mk2', -1898661008, 999, 999, 999, 3500], //312
    ['Глушитель', 'weapon_pistol_mk2', 1709866683, 999, 999, 999, 1500], //313
    ['Компенсатор', 'weapon_pistol_mk2', 568543123, 999, 999, 999, 1850], //314

    ['Глушитель', 'weapon_vintagepistol', -1023114086, 999, 999, 999, 1500], //315

    ['Глушитель', 'weapon_ceramicpistol', -1828202758, 999, 999, 999, 1500], //316

    ['Фонарик', 'weapon_microsmg', 899381934, 999, 999, 999, 350], //317
    ['Прицел', 'weapon_microsmg', -1657815255, 999, 999, 999, 2000], //318
    ['Глушитель', 'weapon_microsmg', -1489156508, 999, 999, 999, 1500], //319

    ['Прицел', 'weapon_smg', 1019656791, 999, 999, 999, 2000], //320
    ['Глушитель', 'weapon_smg', -1023114086, 999, 999, 999, 1500], //321

    ['Фонарик', 'weapon_assaultsmg', 2076495324, 999, 999, 999, 350], //322
    ['Прицел', 'weapon_assaultsmg', -1657815255, 999, 999, 999, 2000], //323
    ['Глушитель', 'weapon_assaultsmg', -1489156508, 999, 999, 999, 1500], //324

    ['Фонарик', 'weapon_smg_mk2', 2076495324, 999, 999, 999, 350], //325
    ['Голографический прицел', 'weapon_smg_mk2', -1613015470, 999, 999, 999, 2500], //326
    ['Прицел малой кратности', 'weapon_smg_mk2', -452809877, 999, 999, 999, 3000], //327
    ['Прицел средней кратности', 'weapon_smg_mk2', 1038927834, 999, 999, 999, 3500], //328
    ['Глушитель', 'weapon_smg_mk2', -1023114086, 999, 999, 999, 1500], //329
    ['Плоский дульный тормоз', 'weapon_smg_mk2', -1181482284, 999, 999, 999, 1900], //330
    ['Тактический дульный тормоз', 'weapon_smg_mk2', -932732805, 999, 999, 999, 1900], //331
    ['Дульный тормоз с толстым наконечником', 'weapon_smg_mk2', -569259057, 999, 999, 999, 1900], //332
    ['Дульный тормоз повышенной точности', 'weapon_smg_mk2', -326080308, 999, 999, 999, 1900], //333
    ['Сверхпрочный дульный тормоз', 'weapon_smg_mk2', 48731514, 999, 999, 999, 1900], //334
    ['Наклонный дульный тормоз', 'weapon_smg_mk2', 880736428, 999, 999, 999, 1900], //335
    ['Разъемный дульный тормоз', 'weapon_smg_mk2', 1303784126, 999, 999, 999, 1900], //336

    ['Глушитель', 'weapon_machinepistol', -1023114086, 999, 999, 999, 1500], //337

    ['Фонарик', 'weapon_combatpdw', 2076495324, 999, 999, 999, 350], //338
    ['Рукоятка', 'weapon_combatpdw', 202788691, 999, 999, 999, 700], //339
    ['Прицел', 'weapon_combatpdw', -1439939148, 999, 999, 999, 2000], //340

    ['Фонарик', 'weapon_pumpshotgun', 2076495324, 999, 999, 999, 350], //341
    ['Глушитель', 'weapon_pumpshotgun', -435637410, 999, 999, 999, 1500], //342

    ['Фонарик', 'weapon_assaultshotgun', 2076495324, 999, 999, 999, 350], //343
    ['Рукоятка', 'weapon_assaultshotgun', 202788691, 999, 999, 999, 700], //344
    ['Глушитель', 'weapon_assaultshotgun', -2089531990, 999, 999, 999, 1500], //345

    ['Фонарик', 'weapon_bullpupshotgun', 2076495324, 999, 999, 999, 350], //346
    ['Рукоятка', 'weapon_bullpupshotgun', 202788691, 999, 999, 999, 700], //347
    ['Глушитель', 'weapon_bullpupshotgun', -1489156508, 999, 999, 999, 1500], //348

    ['Голографический прицел', 'weapon_pumpshotgun_mk2', 1108334355, 999, 999, 999, 2500], //349
    ['Прицел малой кратности', 'weapon_pumpshotgun_mk2', 77277509, 999, 999, 999, 3000], //350
    ['Прицел средней кратности', 'weapon_pumpshotgun_mk2', 1060929921, 999, 999, 999, 3500], //351
    ['Фонарик', 'weapon_pumpshotgun_mk2', 2076495324, 999, 999, 999, 350], //352
    ['Глушитель', 'weapon_pumpshotgun_mk2', -1404903567, 999, 999, 999, 1500], //353
    ['Дульный тормоз', 'weapon_pumpshotgun_mk2', 1602080333, 999, 999, 999, 1900], //354

    ['Фонарик', 'weapon_heavyshotgun', 2076495324, 999, 999, 999, 350], //355
    ['Рукоятка', 'weapon_heavyshotgun', 202788691, 999, 999, 999, 700], //356
    ['Глушитель', 'weapon_heavyshotgun', -1489156508, 999, 999, 999, 1500], //357

    ['Фонарик', 'weapon_assaultrifle', 2076495324, 999, 999, 999, 350], //358
    ['Рукоятка', 'weapon_assaultrifle', 202788691, 999, 999, 999, 700], //359
    ['Глушитель', 'weapon_assaultrifle', -1489156508, 999, 999, 999, 1500], //360
    ['Прицел', 'weapon_assaultrifle', -1657815255, 999, 999, 999, 2000], //361

    ['Фонарик', 'weapon_carbinerifle', 2076495324, 999, 999, 999, 350], //362
    ['Рукоятка', 'weapon_carbinerifle', 202788691, 999, 999, 999, 700], //363
    ['Глушитель', 'weapon_carbinerifle', -2089531990, 999, 999, 999, 1500], //364
    ['Прицел', 'weapon_carbinerifle', -1596416958, 999, 999, 999, 2000], //365

    ['Фонарик', 'weapon_advancedrifle', 2076495324, 999, 999, 999, 350], //366
    ['Глушитель', 'weapon_advancedrifle', -2089531990, 999, 999, 999, 1500], //367
    ['Прицел', 'weapon_advancedrifle', -1439939148, 999, 999, 999, 2000], //368

    ['Фонарик', 'weapon_specialcarbine', 2076495324, 999, 999, 999, 350], //369
    ['Рукоятка', 'weapon_specialcarbine', 202788691, 999, 999, 999, 700], //370
    ['Глушитель', 'weapon_specialcarbine', -1489156508, 999, 999, 999, 1500], //371
    ['Прицел', 'weapon_specialcarbine', -1596416958, 999, 999, 999, 2000], //372

    ['Фонарик', 'weapon_bullpuprifle', 2076495324, 999, 999, 999, 350], //373
    ['Рукоятка', 'weapon_bullpuprifle', 202788691, 999, 999, 999, 700], //374
    ['Глушитель', 'weapon_bullpuprifle', -2089531990, 999, 999, 999, 1500], //375
    ['Прицел', 'weapon_bullpuprifle', -1439939148, 999, 999, 999, 2000], //376

    ['Фонарик', 'weapon_bullpuprifle_mk2', 2076495324, 999, 999, 999, 350], //377
    ['Голографический прицел', 'weapon_bullpuprifle_mk2', 1108334355, 999, 999, 999, 2500], //378
    ['Прицел малой кратности', 'weapon_bullpuprifle_mk2', -944910075, 999, 999, 999, 3000], //379
    ['Прицел средней кратности', 'weapon_bullpuprifle_mk2', 1060929921, 999, 999, 999, 3500], //380
    ['Глушитель', 'weapon_bullpuprifle_mk2', -2089531990, 999, 999, 999, 1500], //381
    ['Плоский дульный тормоз', 'weapon_bullpuprifle_mk2', -1181482284, 999, 999, 999, 1900], //382
    ['Тактический дульный тормоз', 'weapon_bullpuprifle_mk2', -932732805, 999, 999, 999, 1900], //383
    ['Дульный тормоз с толстым наконечником', 'weapon_bullpuprifle_mk2', -569259057, 999, 999, 999, 1900], //384
    ['Дульный тормоз повышенной точности', 'weapon_bullpuprifle_mk2', -326080308, 999, 999, 999, 1900], //385
    ['Сверхпрочный дульный тормоз', 'weapon_bullpuprifle_mk2', 48731514, 999, 999, 999, 1900], //386
    ['Наклонный дульный тормоз', 'weapon_bullpuprifle_mk2', 880736428, 999, 999, 999, 1900], //387
    ['Разъемный дульный тормоз', 'weapon_bullpuprifle_mk2', 1303784126, 999, 999, 999, 1900], //388
    ['Рукоятка', 'weapon_bullpuprifle_mk2', -1654288262, 999, 999, 999, 700], //389

    ['Фонарик', 'weapon_specialcarbine_mk2', 2076495324, 999, 999, 999, 350], //390
    ['Голографический прицел', 'weapon_specialcarbine_mk2', 1108334355, 999, 999, 999, 2500], //391
    ['Прицел малой кратности', 'weapon_specialcarbine_mk2', 77277509, 999, 999, 999, 3000], //392
    ['Прицел большой кратности', 'weapon_specialcarbine_mk2', -966040254, 999, 999, 999, 4000], //393
    ['Глушитель', 'weapon_specialcarbine_mk2', -1489156508, 999, 999, 999, 1500], //394
    ['Плоский дульный тормоз', 'weapon_specialcarbine_mk2', -1181482284, 999, 999, 999, 1900], //395
    ['Тактический дульный тормоз', 'weapon_specialcarbine_mk2', -932732805, 999, 999, 999, 1900], //396
    ['Дульный тормоз с толстым наконечником', 'weapon_specialcarbine_mk2', -569259057, 999, 999, 999, 1900], //397
    ['Дульный тормоз повышенной точности', 'weapon_specialcarbine_mk2', -326080308, 999, 999, 999, 1900], //398
    ['Сверхпрочный дульный тормоз', 'weapon_specialcarbine_mk2', 48731514, 999, 999, 999, 1900], //399
    ['Наклонный дульный тормоз', 'weapon_specialcarbine_mk2', 880736428, 999, 999, 999, 1900], //400
    ['Разъемный дульный тормоз', 'weapon_specialcarbine_mk2', 1303784126, 999, 999, 999, 1900], //401
    ['Рукоятка', 'weapon_specialcarbine_mk2', -1654288262, 999, 999, 999, 700], //402

    ['Фонарик', 'weapon_assaultrifle_mk2', 2076495324, 999, 999, 999, 350], //403
    ['Голографический прицел', 'weapon_assaultrifle_mk2', 1108334355, 999, 999, 999, 2500], //404
    ['Прицел малой кратности', 'weapon_assaultrifle_mk2', 77277509, 999, 999, 999, 3000], //405
    ['Прицел большой кратности', 'weapon_assaultrifle_mk2', -966040254, 999, 999, 999, 4000], //406
    ['Глушитель', 'weapon_assaultrifle_mk2', -1489156508, 999, 999, 999, 1500], //407
    ['Плоский дульный тормоз', 'weapon_assaultrifle_mk2', -1181482284, 999, 999, 999, 1900], //408
    ['Тактический дульный тормоз', 'weapon_assaultrifle_mk2', -932732805, 999, 999, 999, 1900], //409
    ['Дульный тормоз с толстым наконечником', 'weapon_assaultrifle_mk2', -569259057, 999, 999, 999, 1900], //410
    ['Дульный тормоз повышенной точности', 'weapon_assaultrifle_mk2', -326080308, 999, 999, 999, 1900], //411
    ['Сверхпрочный дульный тормоз', 'weapon_assaultrifle_mk2', 48731514, 999, 999, 999, 1900], //412
    ['Наклонный дульный тормоз', 'weapon_assaultrifle_mk2', 880736428, 999, 999, 999, 1900], //413
    ['Разъемный дульный тормоз', 'weapon_assaultrifle_mk2', 1303784126, 999, 999, 999, 1900], //414
    ['Рукоятка', 'weapon_assaultrifle_mk2', -1654288262, 999, 999, 999, 700], //415

    ['Фонарик', 'weapon_carbinerifle_mk2', 2076495324, 999, 999, 999, 350], //416
    ['Голографический прицел', 'weapon_carbinerifle_mk2', 1108334355, 999, 999, 999, 2500], //417
    ['Прицел малой кратности', 'weapon_carbinerifle_mk2', 77277509, 999, 999, 999, 3000], //418
    ['Прицел большой кратности', 'weapon_carbinerifle_mk2', -966040254, 999, 999, 999, 4000], //419
    ['Глушитель', 'weapon_carbinerifle_mk2', -2089531990, 999, 999, 999, 1500], //420
    ['Плоский дульный тормоз', 'weapon_carbinerifle_mk2', -1181482284, 999, 999, 999, 1900], //421
    ['Тактический дульный тормоз', 'weapon_carbinerifle_mk2', -932732805, 999, 999, 999, 1900], //422
    ['Дульный тормоз с толстым наконечником', 'weapon_carbinerifle_mk2', -569259057, 999, 999, 999, 1900], //423
    ['Дульный тормоз повышенной точности', 'weapon_carbinerifle_mk2', -326080308, 999, 999, 999, 1900], //424
    ['Сверхпрочный дульный тормоз', 'weapon_carbinerifle_mk2', 48731514, 999, 999, 999, 1900], //425
    ['Наклонный дульный тормоз', 'weapon_carbinerifle_mk2', 880736428, 999, 999, 999, 1900], //426
    ['Разъемный дульный тормоз', 'weapon_carbinerifle_mk2', 1303784126, 999, 999, 999, 1900], //427
    ['Рукоятка', 'weapon_carbinerifle_mk2', -1654288262, 999, 999, 999, 700], //428

    ['Прицел', 'weapon_mg', 1006677997, 999, 999, 999, 2000], //429

    ['Прицел', 'weapon_combatmg', -1596416958, 999, 999, 999, 2000], //430
    ['Рукоятка', 'weapon_combatmg', 202788691, 999, 999, 999, 700], //431

    ['Голографический прицел', 'weapon_combatmg_mk2', 1108334355, 999, 999, 999, 2500], //432
    ['Прицел средней кратности', 'weapon_combatmg_mk2', 1060929921, 999, 999, 999, 3500], //433
    ['Прицел большой кратности', 'weapon_combatmg_mk2', -966040254, 999, 999, 999, 4000], //434
    ['Плоский дульный тормоз', 'weapon_combatmg_mk2', -1181482284, 999, 999, 999, 1900], //435
    ['Тактический дульный тормоз', 'weapon_combatmg_mk2', -932732805, 999, 999, 999, 1900], //436
    ['Дульный тормоз с толстым наконечником', 'weapon_combatmg_mk2', -569259057, 999, 999, 999, 1900], //437
    ['Дульный тормоз повышенной точности', 'weapon_combatmg_mk2', -326080308, 999, 999, 999, 1900], //438
    ['Сверхпрочный дульный тормоз', 'weapon_combatmg_mk2', 48731514, 999, 999, 999, 1900], //439
    ['Наклонный дульный тормоз', 'weapon_combatmg_mk2', 880736428, 999, 999, 999, 1900], //440
    ['Разъемный дульный тормоз', 'weapon_combatmg_mk2', 1303784126, 999, 999, 999, 1900], //441
    ['Рукоятка', 'weapon_combatmg_mk2', -1654288262, 999, 999, 999, 700], //442

    ['Прицел', 'weapon_sniperrifle', -767279652, 999, 999, 999, 2000], //443
    ['Модернизированный прицел', 'weapon_sniperrifle', -1135289737, 999, 999, 999, 3000], //444

    ['Прицел', 'weapon_heavysniper', -767279652, 999, 999, 999, 2000], //445
    ['Модернизированный прицел', 'weapon_heavysniper', -1135289737, 999, 999, 999, 3000], //446

    ['Фонарик', 'weapon_marksmanrifle_mk2', 2076495324, 999, 999, 999, 350], //447
    ['Голографический прицел', 'weapon_marksmanrifle_mk2', 1108334355, 999, 999, 999, 2500], //448
    ['Кратный прицел', 'weapon_marksmanrifle_mk2', 1528590652, 999, 999, 999, 2750], //449
    ['Прицел большой кратности', 'weapon_marksmanrifle_mk2', -966040254, 999, 999, 999, 4000], //450
    ['Глушитель', 'weapon_marksmanrifle_mk2', -2089531990, 999, 999, 999, 1500], //451
    ['Плоский дульный тормоз', 'weapon_marksmanrifle_mk2', -1181482284, 999, 999, 999, 1900], //452
    ['Тактический дульный тормоз', 'weapon_marksmanrifle_mk2', -932732805, 999, 999, 999, 1900], //453
    ['Дульный тормоз с толстым наконечником', 'weapon_marksmanrifle_mk2', -569259057, 999, 999, 999, 1900], //454
    ['Дульный тормоз повышенной точности', 'weapon_marksmanrifle_mk2', -326080308, 999, 999, 999, 1900], //455
    ['Сверхпрочный дульный тормоз', 'weapon_marksmanrifle_mk2', 48731514, 999, 999, 999, 1900], //456
    ['Наклонный дульный тормоз', 'weapon_marksmanrifle_mk2', 880736428, 999, 999, 999, 1900], //457
    ['Разъемный дульный тормоз', 'weapon_marksmanrifle_mk2', 1303784126, 999, 999, 999, 1900], //458
    ['Рукоятка', 'weapon_marksmanrifle_mk2', -1654288262, 999, 999, 999, 700], //459

    ['Тепловизионный прицел', 'weapon_heavysniper_mk2', 776198721, 999, 999, 999, 5000], //460
    ['Прицел ночного видения', 'weapon_heavysniper_mk2', -1233121104, 999, 999, 999, 4500], //461
    ['Кратный прицел', 'weapon_heavysniper_mk2', -2101279869, 999, 999, 999, 2750], //462
    ['Модернизированный прицел', 'weapon_heavysniper_mk2', -1135289737, 999, 999, 999, 3000], //463
    ['Глушитель', 'weapon_heavysniper_mk2', -1404903567, 999, 999, 999, 1500], //464
    ['Дульный тормоз', 'weapon_heavysniper_mk2', 1602080333, 999, 999, 999, 1900], //465
    ['Дульный тормоз с тупым наконечником', 'weapon_heavysniper_mk2', 1764221345, 999, 999, 999, 1900], //466

    ['Фонарик', 'weapon_marksmanrifle', 2076495324, 999, 999, 999, 350], //467
    ['Рукоятка', 'weapon_marksmanrifle', 202788691, 999, 999, 999, 700], //468
    ['Глушитель', 'weapon_marksmanrifle', -2089531990, 999, 999, 999, 1500], //469
    ['Прицел', 'weapon_marksmanrifle', 471997210, 999, 999, 999, 2000], //470

    ['Фонарик', 'weapon_grenadelauncher', 2076495324, 999, 999, 999, 350], //471
    ['Рукоятка', 'weapon_grenadelauncher', 202788691, 999, 999, 999, 700], //472
    ['Прицел', 'weapon_grenadelauncher', -1439939148, 999, 999, 999, 2000], //473
];

items.isWeapon = function(itemId) {
    return itemId >= 54 && itemId <= 138;
};

items.isAmmo = function(itemId) {
    return itemId >= 279 && itemId <= 292;
};

items.getAmmoCount = function(itemId) {
    switch (itemId) {
        case 279:
        case 288:
        case 290:
            return 10;
        case 280:
            return 140;
        case 281:
            return 120;
        case 282:
            return 130;
        case 283:
        case 284:
            return 260;
        case 285:
        case 286:
        case 287:
            return 60;
        case 289:
        case 291:
        case 292:
            return 1;
    }
    return 10;
};

items.canEquipById = function(id)
{
    try
    {
        return items.itemList[id][2];
    }
    catch
    {
        return false;
    }
};

items.getItemNameById = function(id)
{
    try
    {
        return items.itemList[id][0];
    }
    catch
    {
        return "UNKNOWN";
    }
};

items.getItemNameHashById = function(id)
{
    try
    {
        return items.itemList[id][1];
    }
    catch
    {
        return "UNKNOWN";
    }
};

items.getItemHashById = function(id)
{
    try
    {
        return items.itemList[id][3];
    }
    catch
    {
        return 1108364521;
    }
};

items.getItemWeightById = function(id)
{
    try
    {
        return items.itemList[id][4];
    }
    catch
    {
        return -1;
    }
};

items.getItemWeightKgById = function(id)
{
    try
    {
        return Math.Round(items.itemList[id][4] / 1000.0);
    }
    catch
    {
        return -1;
    }
};

items.getItemAmountById = function(id)
{
    try
    {
        return items.itemList[id][5];
    }
    catch
    {
        return -1;
    }
};

items.getItemPrice = function(id) {
    try
    {
        return items.itemList[id][6];
    }
    catch
    {
        return 0;
    }
};
